cases/artigo_mestrado/old/sugestao/fluid/constant/dynamicMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      dynamicMeshDict;
}

// One-way FSI (forças fluido→sólido): malha fluida fixa até malhas FSI coincidentes.
dynamicFvMesh           staticFvMesh;
